/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tishihar <tishihar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/03/19 15:45:47 by tishihar          #+#    #+#             */
/*   Updated: 2025/03/21 17:39:44 by tishihar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "philo.h"

int	main(void)
{
	
	// 0:まずはヘッダーに構造体を打ち込む

	// 1:コマンドライン引数をそれぞれの構造体にぶちこむ
	// number_of_philosophers
	// time_to_die
	// time_to_eat
	// time_to_sleep
	// [number_of_times_each_philosopher_must_eat]


	// 2:人数ぶんのスレッドと、共用リソースを用意して環境を整える(ここはとりあえず人数ぶんスレッドを用意。フォークはこのスコープ変数になるわけだ)

	// 3:mutexを使って競合をなくす
}
